package com.example.myapplication2

data class Catdata(val info: String)

val inf = Catdata(
    "Американський бобтейл - яскравий представник короткохвостих красенів. Ці кошенята відрізняються великою активністю, цікавим забарвленням і, звичайно ж, особливою формою хвоста. Гарні, грайливі й того ж часу розумні улюбленці, популярні у всьому світі.Ця порода має сьогодні кілька різновидів. До того ж кішка відрізняється за деякими ознаками від кота. Однак існує ряд загальних особливостей: вага від 3 до 8 кг велика, широка голова, що нагадує клин, носик трохи звужений, вушка середнього розміру, розміщені на широкій відстані та трохи опущені донизу очі можуть відрізнятися за кольором, вони широко посаджені і трохи нахилені до носика, така форма додає коту грайливості лапи сильні, м'язи добре розвинені, задні трохи ширші за передні особливістю є маленький хвіст, він не перевищує 7 см шерсть довга та густа, забарвлення різноманітне."
)

data class Dogdata(val info1: String)

val inf1 = Dogdata(
    "Золотистий ретрівер - мисливський собака великого розміру, якого ще наприкінці 19 століття вивели у Великобританії. Дана порода відрізняється високим інтелектом у поєднанні з чудовим характером, завдяки чому золотистий ретрівер вважається універсальною твариною.Зовнішній вигляд золотистого ретрівера дуже привабливий і мало хто може пройти повз такого собаку без бажання його приголубити. Стандарт приписує широку і глибоку, але не масивну морду, чітко виражений перехід до неї від чола. Представники цієї породи мають темно-карі очі, обведені чорною смужкою. Вони відразу ж повідомляють, чи доброзичливо налаштований до вас собака. Забарвлення шерсті може бути золотистим, звідки й пішла назва, і кремовим. Висота в холці становить до 61 см."
)

data class Elephantdata(val info2: String)

val inf2 = Elephantdata(
    "До складу роду входить 2 види: африканський слон лісовий, який населяє тропічні й прилеглі до них ліси, та африканський слон саванний, — мешкає на територіях з лісовою, трав’яною, водно-болотною, пустельною рослинністю. Це найбільші живі наземні тварини. Маса дорослих самців становить 1200–6300 кг, висота в холці — 1,7–4,0 м. Бивні є модифікованими різцями й використовуються під час боїв, для маркування й копання. Мускулистий хобот є подовженням носа, слугує для нюху, дихання й різноманітних маніпуляцій, подібно до верхніх кінцівок людини. Віяльні рухи великими вухами допомагають регулювати температуру тіла, оскільки у цих тварин мало потових залоз. Їхні ноги чутливі, сприйнятливі до вібрацій землі, а великі ступні й товсті жирові подушечки на них діють, як амортизатори."
)





